/*Jamie8051 작성*/
//21.10.19 git fork를 위한 테스트 git 파일 생성
//git 사용 방법을 익히는 과정


/*magi8051 작성*/
//협업을 위해서 코드를 추가한다.
//내가 작성한 코드가 Jamie8051 코드에서 인정을 받기 위한 과정
//어떻게 내 코드가 업데이트 될것인가?

/*magi8051 작성*/
//두번째 코드 수정 제안한다.
//이번 시나리오에서는 내 코드에 대한 거부 과정 진행


/*magi8051 작성 - full request*/
//두번째 제안된 코드에 대해서 수정을 진행하고 다시 full request 진행
//현재 코드가 반영이 된다면, 지금까지 내용 모두 업데이트가 될 것으로 예상

/*jamie8051 작성 - 내용 수정*/
//기존 full request에 대한 요청을 반영하고 내 코드를 추가한다.
//magi8051이 추가된 코드를 반영해서 확인하고 pull 요청

/*jamie8051 - 코드 수정 및 업데이트*/
//수정된 내용은 commit 하고 서버에 push
//변경된 내용을 pull 해서 업데이트 받는다


/*magi8051 - branch test */
//현재 상황에서 새로운 코드 테스트를 위해 분기를 시도한다.

/*magi8051 - branch start*/
//새로운 코드가 브랜치에서 시작.
//이 내용은 main 에 반영되지 않아야한다.
